# 1. Напишите программу, которая принимает на вход цифру, обозначающую день недели, и проверяет, является ли этот день выходным.
    
#     *Пример:*
    
#     - 6 -> да
#     - 7 -> да
#     - 1 -> нет

# day = int(input('Введите день недели\n'))
# match day:
#     case 1|2|3|4|5:
#         print('Нет')
#     case 6|7:
#         print('Да')
#     case _:
#         print('Попробуй ещё')

# 2. Напишите программу, которая принимает на вход координаты точки (X и Y), и выдаёт номер четверти плоскости, в которой находится эта точка (или на какой оси она находится).
    
#     *Пример:*
    
#     - x=34; y=-30 -> 4
#     - x=2; y=4-> 1
#     - x=-34; y=-30 -> 3

# X = float(input('Введите координату точки, относительно оси абсцисс - '))
# Y = float(input('Введите координату точки, относительно оси ординат - '))

# def quater(x_coordinate, y_coordinate):
#     if x>0 and y>0:
#         print('Точка находится в I четверти')
#     elif x<0 and y>0:
#         print('Точка находится во II четверти')
#     elif x<0 and y<0:
#         print('Точка находится в III четверти')
#     elif x>0 and y<0:
#         print('Точка находи   тся в IV четверти')
#     elif x == 0 and y != 0:
#         print('Точка лежит на оси ординат')
#     elif y == 0 and x != 0:
#         print('точка лежит на оси абсцисс')
#     elif x == 0 and y == 0:
#         print('Точка в начале координат')
#     else:
#         print('Чертовщини какая-то')
# quater(X,Y)
# 3. Напишите программу, которая по заданному номеру четверти, показывает диапазон возможных координат точек в этой четверти (x и y).

# def sets(quater):
#     if quater == 'I':
#         quater = 1
#     elif quater == 'II':
#         quater = 2
#     elif quater == 'III':
#         quater = 3
#     elif quater == 'iv':
#         quater = 4
#     quater = int(quater)
#     match quater:
#         case 1:
#             print('X ∈ (0, +∞), Y ∈ (0, +∞) ')
#         case 2:
#             print('X ∈ (0, -∞) Y ∈ (0, +∞)')
#         case 3:
#             print('X ∈ (0, -∞) Y ∈ (0, -∞)')
#         case 4:
#             print('X ∈ (0, +∞) Y ∈ (0, -∞)')
#         case _:
#             print('Какая-то фигня')

# number = input('Введите номер четверти координатной плоскости: ')
# sets(number)

# 4. Напишите программу, которая принимает на вход координаты двух точек и находит расстояние между ними в 2D пространстве.
# import math
# def trunc(a, x):
#     int1 = int(a * (10**x))/(10**x)
#     return float(int1)
# print('Введите последовательно координаты точки А и B')
# x_a = int(input('xA: '))
# y_a = int(input('yA: '))
# x_b = int(input('xB: '))
# y_b = int(input('yB: '))
# dist = (float(math.sqrt((x_b-x_a)**2 + (y_b-y_a)**2)))
# print(f'Расстояние между A{x_a, y_a} и B{x_b, y_b}: {trunc(dist, 2)}')

# print(truncate((math.sqrt((x_b-x_a)**2 + (y_b-y_a)**2)),3))
#     *Пример:*
    
#     - A (3,6); B (2,1) -> 5,09
#     - A (7,-5); B (1,-1) -> 7,21